misc/artillery/conns/load.yml
config:
  target: "ws://localhost:8000/connection/websocket"
  phases:
    - duration: 200
      arrivalRate: 50
      name: "Create connections"
scenarios:
  - engine: "ws"
    flow:
      - send: '{"id":1}'
      - think: 2
      - send: '{"id":2,"method":"subscribe","params":{"channel": "channel"}}'
      - think: 3600